TGA Testing/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// block3

scale   0.01;

vertices
(

    ( 1		-1	0) //0
    ( 1 	 1	0) //4
    (-1 	 1	0) //7
    (-1 	-1	0) //3
    ( 1  	-1	5) //1
    ( 1  	 1	5) //5
    (-1 	 1	5) //6
    (-1 	-1	5) //2





);

blocks
(
    hex (0  1  2  3  4  5  6  7) (10 10 86) 
	simpleGrading 	
	(
          (
                (0.05  0.1 4)
		(0.90  0.8 1)
                (0.05  0.1 0.25)
          )
          (
                (0.05  0.1 4)
		(0.90  0.8 1)
                (0.05  0.1 0.25)
          )
          (
		(1 1 1)
	  )
	)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
	    (0 1 2 3)	    
	);
    }

    furnaceWall
    {
	type wall;
	faces
	(
            (1 5 6 2)
	    (4 0 3 7)
  	    (3 2 6 7)
	    (0 1 5 4)	
        );
    }

    outlet
    {
	type patch;
	faces
	(
	    (5 4 7 6)
	);
     }

/*    symmetry
    {
	type symmetry;
	faces
	(
	    (4 0 3 7)
	);
    }*/
);

// ************************************************************************* //
