TGA Testing/constant/coalCloud1Positions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v606                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    location    "";
    class       vectorField;
    object      coalCloud1Positions;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
(
//10x10 grid of particles

( 0.0072	0.0072		0.02)
( 0.0056	0.0072		0.02)
( 0.00400	0.0072		0.02)
( 0.0024	0.0072		0.02)
( 0.0008	0.0072		0.02)
(-0.0008	0.0072		0.02)
(-0.0024	0.0072		0.02)
(-0.00400	0.0072		0.02)
(-0.0056	0.0072		0.02)
(-0.0072	0.0072		0.02)

( 0.0072	0.0056		0.02)
( 0.0056	0.0056		0.02)
( 0.00400	0.0056		0.02)
( 0.0024	0.0056		0.02)
( 0.0008	0.0056		0.02)
(-0.0008	0.0056		0.02)
(-0.0024	0.0056		0.02)
(-0.00400	0.0056		0.02)
(-0.0056	0.0056		0.02)
(-0.0072	0.0056		0.02)

( 0.0072	0.00400		0.02)
( 0.0056	0.00400		0.02)
( 0.00400	0.00400		0.02)
( 0.0024	0.00400		0.02)
( 0.0008	0.00400		0.02)
(-0.0008	0.00400		0.02)
(-0.0024	0.00400		0.02)
(-0.00400	0.00400		0.02)
(-0.0056	0.00400		0.02)
(-0.0072	0.00400		0.02)

( 0.0072	0.0024		0.02)
( 0.0056	0.0024		0.02)
( 0.00400	0.0024		0.02)
( 0.0024	0.0024		0.02)
( 0.0008	0.0024		0.02)
(-0.0008	0.0024		0.02)
(-0.0024	0.0024		0.02)
(-0.00400	0.0024		0.02)
(-0.0056	0.0024		0.02)
(-0.0072	0.0024		0.02)

( 0.0072	0.0008		0.02)
( 0.0056	0.0008		0.02)
( 0.00400	0.0008		0.02)
( 0.0024	0.0008		0.02)
( 0.0008	0.0008		0.02)
(-0.0008	0.0008		0.02)
(-0.0024	0.0008		0.02)
(-0.00400	0.0008		0.02)
(-0.0056	0.0008		0.02)
(-0.0072	0.0008		0.02)

( 0.0072	-0.0072		0.02)
( 0.0056	-0.0072		0.02)
( 0.00400	-0.0072		0.02)
( 0.0024	-0.0072		0.02)
( 0.0008	-0.0072		0.02)
(-0.0008	-0.0072		0.02)
(-0.0024	-0.0072		0.02)
(-0.00400	-0.0072		0.02)
(-0.0056	-0.0072		0.02)
(-0.0072	-0.0072		0.02)

( 0.0072	-0.0056		0.02)
( 0.0056	-0.0056		0.02)
( 0.00400	-0.0056		0.02)
( 0.0024	-0.0056		0.02)
( 0.0008	-0.0056		0.02)
(-0.0008	-0.0056		0.02)
(-0.0024	-0.0056		0.02)
(-0.00400	-0.0056		0.02)
(-0.0056	-0.0056		0.02)
(-0.0072	-0.0056		0.02)

( 0.0072	-0.00400		0.02)
( 0.0056	-0.00400		0.02)
( 0.00400	-0.00400		0.02)
( 0.0024	-0.00400		0.02)
( 0.0008	-0.00400		0.02)
(-0.0008	-0.00400		0.02)
(-0.0024	-0.00400		0.02)
(-0.00400	-0.00400		0.02)
(-0.0056	-0.00400		0.02)
(-0.0072	-0.00400		0.02)

( 0.0072	-0.0024		0.02)
( 0.0056	-0.0024		0.02)
( 0.00400	-0.0024		0.02)
( 0.0024	-0.0024		0.02)
( 0.0008	-0.0024		0.02)
(-0.0008	-0.0024		0.02)
(-0.0024	-0.0024		0.02)
(-0.00400	-0.0024		0.02)
(-0.0056	-0.0024		0.02)
(-0.0072	-0.0024		0.02)

( 0.0072	-0.0008		0.02)
( 0.0056	-0.0008		0.02)
( 0.00400	-0.0008		0.02)
( 0.0024	-0.0008		0.02)
( 0.0008	-0.0008		0.02)
(-0.0008	-0.0008		0.02)
(-0.0024	-0.0008		0.02)
(-0.00400	-0.0008		0.02)
(-0.0056	-0.0008		0.02)
(-0.0072	-0.0008		0.02)

/*
//second layer

( 0.00406	0.00406		0.02004)
( 0.00402	0.00406		0.02004)
( 0.0008	0.00406		0.02004)
( 0.0004	0.00406		0.02004)
( 0.0		0.00406		0.02004)
(-0.0004	0.00406		0.02004)
(-0.0008	0.00406		0.02004)
(-0.00402	0.00406		0.02004)
(-0.00406	0.00406		0.02004)

( 0.00406	0.00402		0.02004)
( 0.00402	0.00402		0.02004)
( 0.0008	0.00402		0.02004)
( 0.0004	0.00402		0.02004)
( 0.0		0.00402		0.02004)
(-0.0004	0.00402		0.02004)
(-0.0008	0.00402		0.02004)
(-0.00402	0.00402		0.02004)
(-0.00406	0.00402		0.02004)

( 0.00406	0.0008		0.02004)
( 0.00402	0.0008		0.02004)
( 0.0008	0.0008		0.02004)
( 0.0004	0.0008		0.02004)
( 0.0		0.0008		0.02004)
(-0.0004	0.0008		0.02004)
(-0.0008	0.0008		0.02004)
(-0.00402	0.0008		0.02004)
(-0.00406	0.0008		0.02004)

( 0.00406	0.0004		0.02004)
( 0.00402	0.0004		0.02004)
( 0.0008	0.0004		0.02004)
( 0.0004	0.0004		0.02004)
( 0.0		0.0004		0.02004)
(-0.0004	0.0004		0.02004)
(-0.0008	0.0004		0.02004)
(-0.00402	0.0004		0.02004)
(-0.00406	0.0004		0.02004)

( 0.00406	0.00		0.02004)
( 0.00402	0.00		0.02004)
( 0.0008	0.00		0.02004)
( 0.0004	0.00		0.02004)
( 0.0		0.00		0.02004)
(-0.0004	0.00		0.02004)
(-0.0008	0.00		0.02004)
(-0.00402	0.00		0.02004)
(-0.00406	0.00		0.02004)

( 0.00406	-0.00406		0.02004)
( 0.00402	-0.00406		0.02004)
( 0.0008	-0.00406		0.02004)
( 0.0004	-0.00406		0.02004)
( 0.0		-0.00406		0.02004)
(-0.0004	-0.00406		0.02004)
(-0.0008	-0.00406		0.02004)
(-0.00402	-0.00406		0.02004)
(-0.00406	-0.00406		0.02004)

( 0.00406	-0.00402		0.02004)
( 0.00402	-0.00402		0.02004)
( 0.0008	-0.00402		0.02004)
( 0.0004	-0.00402		0.02004)
( 0.0		-0.00402		0.02004)
(-0.0004	-0.00402		0.02004)
(-0.0008	-0.00402		0.02004)
(-0.00402	-0.00402		0.02004)
(-0.00406	-0.00402		0.02004)

( 0.00406	-0.0008		0.02004)
( 0.00402	-0.0008		0.02004)
( 0.0008	-0.0008		0.02004)
( 0.0004	-0.0008		0.02004)
( 0.0		-0.0008		0.02004)
(-0.0004	-0.0008		0.02004)
(-0.0008	-0.0008		0.02004)
(-0.00402	-0.0008		0.02004)
(-0.00406	-0.0008		0.02004)

( 0.00406	-0.0004		0.02004)
( 0.00402	-0.0004		0.02004)
( 0.0008	-0.0004		0.02004)
( 0.0004	-0.0004		0.02004)
( 0.0		-0.0004		0.02004)
(-0.0004	-0.0004		0.02004)
(-0.0008	-0.0004		0.02004)
(-0.00402	-0.0004		0.02004)
(-0.00406	-0.0004		0.02004)

//Third Layer

( 0.0072	0.0072		0.02008)
( 0.0056	0.0072		0.02008)
( 0.00400	0.0072		0.02008)
( 0.0024	0.0072		0.02008)
( 0.0008	0.0072		0.02008)
(-0.0008	0.0072		0.02008)
(-0.0024	0.0072		0.02008)
(-0.00400	0.0072		0.02008)
(-0.0056	0.0072		0.02008)
(-0.0072	0.0072		0.02008)

( 0.0072	0.0056		0.02008)
( 0.0056	0.0056		0.02008)
( 0.00400	0.0056		0.02008)
( 0.0024	0.0056		0.02008)
( 0.0008	0.0056		0.02008)
(-0.0008	0.0056		0.02008)
(-0.0024	0.0056		0.02008)
(-0.00400	0.0056		0.02008)
(-0.0056	0.0056		0.02008)
(-0.0072	0.0056		0.02008)

( 0.0072	0.00400		0.02008)
( 0.0056	0.00400		0.02008)
( 0.00400	0.00400		0.02008)
( 0.0024	0.00400		0.02008)
( 0.0008	0.00400		0.02008)
(-0.0008	0.00400		0.02008)
(-0.0024	0.00400		0.02008)
(-0.00400	0.00400		0.02008)
(-0.0056	0.00400		0.02008)
(-0.0072	0.00400		0.02008)

( 0.0072	0.0024		0.02008)
( 0.0056	0.0024		0.02008)
( 0.00400	0.0024		0.02008)
( 0.0024	0.0024		0.02008)
( 0.0008	0.0024		0.02008)
(-0.0008	0.0024		0.02008)
(-0.0024	0.0024		0.02008)
(-0.00400	0.0024		0.02008)
(-0.0056	0.0024		0.02008)
(-0.0072	0.0024		0.02008)

( 0.0072	0.0008		0.02008)
( 0.0056	0.0008		0.02008)
( 0.00400	0.0008		0.02008)
( 0.0024	0.0008		0.02008)
( 0.0008	0.0008		0.02008)
(-0.0008	0.0008		0.02008)
(-0.0024	0.0008		0.02008)
(-0.00400	0.0008		0.02008)
(-0.0056	0.0008		0.02008)
(-0.0072	0.0008		0.02008)

( 0.0072	-0.0072		0.02008)
( 0.0056	-0.0072		0.02008)
( 0.00400	-0.0072		0.02008)
( 0.0024	-0.0072		0.02008)
( 0.0008	-0.0072		0.02008)
(-0.0008	-0.0072		0.02008)
(-0.0024	-0.0072		0.02008)
(-0.00400	-0.0072		0.02008)
(-0.0056	-0.0072		0.02008)
(-0.0072	-0.0072		0.02008)

( 0.0072	-0.0056		0.02008)
( 0.0056	-0.0056		0.02008)
( 0.00400	-0.0056		0.02008)
( 0.0024	-0.0056		0.02008)
( 0.0008	-0.0056		0.02008)
(-0.0008	-0.0056		0.02008)
(-0.0024	-0.0056		0.02008)
(-0.00400	-0.0056		0.02008)
(-0.0056	-0.0056		0.02008)
(-0.0072	-0.0056		0.02008)

( 0.0072	-0.00400		0.02008)
( 0.0056	-0.00400		0.02008)
( 0.00400	-0.00400		0.02008)
( 0.0024	-0.00400		0.02008)
( 0.0008	-0.00400		0.02008)
(-0.0008	-0.00400		0.02008)
(-0.0024	-0.00400		0.02008)
(-0.00400	-0.00400		0.02008)
(-0.0056	-0.00400		0.02008)
(-0.0072	-0.00400		0.02008)

( 0.0072	-0.0024		0.02008)
( 0.0056	-0.0024		0.02008)
( 0.00400	-0.0024		0.02008)
( 0.0024	-0.0024		0.02008)
( 0.0008	-0.0024		0.02008)
(-0.0008	-0.0024		0.02008)
(-0.0024	-0.0024		0.02008)
(-0.00400	-0.0024		0.02008)
(-0.0056	-0.0024		0.02008)
(-0.0072	-0.0024		0.02008)

( 0.0072	-0.0008		0.02008)
( 0.0056	-0.0008		0.02008)
( 0.00400	-0.0008		0.02008)
( 0.0024	-0.0008		0.02008)
( 0.0008	-0.0008		0.02008)
(-0.0008	-0.0008		0.02008)
(-0.0024	-0.0008		0.02008)
(-0.00400	-0.0008		0.02008)
(-0.0056	-0.0008		0.02008)
(-0.0072	-0.0008		0.02008)
*/
)
// ************************************************************************* //
