TGA Testing/constant/coalCloud1Properties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      coalCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    transient       yes;
    coupled         true;
    cellValueSourceCorrection on;
    maxCo           0.3;

    sourceTerms
    {
        schemes
        {
            rho             semiImplicit 1;
            U               semiImplicit 1;
            Yi              semiImplicit 1;
            h               semiImplicit 1;
            radiation       semiImplicit 1;
        }
    }

    interpolationSchemes
    {
        rho             cell;
        U               cellPoint;
        thermo:mu       cell;
        T               cell;
        Cp              cell;
        kappa           cell;
        p               cell;
        G               cell;
    }

    integrationSchemes
    {
        U               Euler;
        T               analytical;
    }
}

constantProperties
{
    rho0            1000;
    T0              500;
    Cp0             4187;       // Heat capacity [J/(kg*K)] 
    epsilon0        1;		// Particle emissivity []
    f0              0.5;	// Particle scattering factor 

    TDevol          400;	// Devolatilisation Temperature [K]
    LDevol          0;		// Latent heat of devolatilisation [J/kg] ANSYS
    hRetentionCoeff 1;		// Fraction of enthalpy retained by
				// parcel due to surface reactions
	
    constantVolume  false;
}

subModels
{
    particleForces
    {
//        sphereDrag;
//        gravity;
    }

    injectionModels
    {
        model1
        {
            type            	manualInjection;
            massTotal       	6.545e-9;		// 10X10 Particles 
            SOI             	0;
            parcelBasisType 	mass;
            positionsFile	"coalCloud1Positions";
            U0              	(0 0 0);
            sizeDistribution
            {
                type        fixedValue;
                fixedValueDistribution
                {
                   value        5e-05;	// Global Coal Devol - Mean Bit Coal Diameter
                }
            }
        }
    }

    dispersionModel stochasticDispersionRAS;

    patchInteractionModel standardWallInteraction;

    heatTransferModel RanzMarshall;

    compositionModel singleMixtureFraction;

    phaseChangeModel liquidEvaporation;

    devolatilisationModel kobayashiDevolatilisation;

    stochasticCollisionModel none;

    surfaceReactionModel none;

    surfaceFilmModel none;

    radiation       on;

    standardWallInteractionCoeffs
    {
        type            rebound;
        e               1;
        mu              0;
    }

    RanzMarshallCoeffs
    {
        BirdCorrection  true;
    }

    singleMixtureFractionCoeffs
    {
        phases
        (
            gas
            {
                CH4             0.365; 
                H2              0.556; 
                CO              0.079;
            }
            liquid
            {
                H2O             1;
            }
            solid
            {
                ash             0.1835; // Calenturitas Coal TGA
                C               0.8165; 
            }
        );
        YGasTot0        0.285;  // Volatile Content of TGA
        YLiquidTot0     0.0; 
        YSolidTot0      0.715; 
    }

    liquidEvaporationCoeffs
    {
        enthalpyTransfer enthalpyDifference;

        activeLiquids
        (
            H2O
        );
    }

//**********************DEVOL-COEFFS*****************************************//

// Gas Consant (RR) = J/(kmol*K)
// Pre-exponential Factor (A) = 1/s
// Activation Energy (E) = J/kmol

// da/dt used for optimization

// primalOptIndv

    kobayashiDevolatilisationCoeffs
    {
        volatileData 
        (
            (CH4            0.104	3.666e5		1.098e8
                            1.000	1.05e2		2.293e8		1) 

            (H2             0.159	1.00e2		7.834e7
                            1.000	1.00e2		2.247e8		1) 

            (CO             0.023	1.00e2		6.371e7	
                            1.000	1.00e2		2.298e8		1) 
        );
        residualCoeff   0.001;
    } 

//***************************************************************************//

    COxidationKineticDiffusionLimitedRateCoeffs
    {
        Sb              1;
        C1              5.0E-12;
        C2              0.002;
        E               7.9E+07;
    }
}



cloudFunctions
{}


// ************************************************************************* //
