TGA Testing/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (0 0 0.05);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0.05);
    }
    cbase
    {
	type 		noSlip;
    }
    furnaceWall
    {
        type            noSlip;
    }
    outlet
    {
        type            zeroGradient;
    }
    symmetry
    {
        type            symmetry;
    }
    empty
    {
	type		empty;
    }
}


// ************************************************************************* //
