TGA Testing/0/G
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            MarshakRadiation;
        T               T;
        emissivityMode  lookup;
        emissivity      1;
        value           uniform 0;
    }
    cbase
    {
        type            MarshakRadiation;
        T               T;
        emissivityMode  lookup;
        emissivity      1;
        value           uniform 0;
    }
    furnaceWall
    {
        type            MarshakRadiation;
        T               T;
        emissivityMode  lookup;
        emissivity      1;
        value           uniform 0;
    }
    outlet
    {
        type            MarshakRadiation;
        T               T;
        emissivityMode  lookup;
        emissivity      1;
        value           uniform 0;
    }
    symmetry
    {
        type            symmetry;
    }
    empty
    {
	type		empty;
    }

}


// ************************************************************************* //
