TGA Testing/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];


internalField   uniform 500;

boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue 	polynomial
	(
	    (500     	0)
	    (0.08333	1)  // 5 C/min
	);
    }
    furnaceWall
    {
        type            uniformFixedValue;
        uniformValue    polynomial
        (
        (500        0)
	    (0.08333    1)
        );
    }
    outlet
    {
        type            zeroGradient;
    }
    symmetry
    {
        type            symmetry;
    }

}


// ************************************************************************* //
