TGA Testing/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|G)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0.1;
    }

   "(rho|G)Final"
    {
        $rho;
        tolerance       1e-10;
        relTol          0;
    }

    p
    {
        solver           PBiCGStab;
        tolerance        1e-10;
        relTol           0.01;
        preconditioner	 DILU;

	/*smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        nFinestSweeps    2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;
        maxIter          50;
        mergeLevels      1; */
    }

    pFinal
    {
        $p;
        tolerance       1e-10;
        relTol          0;
    }

    "(U|h|R|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-10;
        relTol          0.1;
    }

    "(U|h|R|k|epsilon)Final"
    {
        $U;
        tolerance       1e-10;
        relTol          0;
    }

    "(Yi|CO2|O2|N2|CH4|H2|H2O|CO)"
    {
        $h;
    }

    "(Yi|CO2|O2|N2|CH4|H2|H2O|CO)Final"
    {
        $Yi;
        tolerance       1e-10;
        relTol          0;
    }
}

PIMPLE
{
    transonic       yes;
    nOuterCorrectors 2;
    nCorrectors     2;
    nNonOrthogonalCorrectors 2;
    momentumPredictor yes;
    turbOnFinalIterOnly false;
}


relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        ".*"            1; //0.3;
        U		0.7;
	k 		0.7;
	epsilon		0.7;
    }
}
cache
{
    grad(U);
}
// ************************************************************************* //
