TGA Testing/system/kobayashi_blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(

    (0		0	0) //0
    (3		0 	0) //1
    (3		3 	0) //2
    (0 		3 	0) //3
    (0		0	3) //4
    (3		0	3) //5
    (3		3	3) //6
    (0		3	3) //7

);

blocks
(
    hex (0  1  2  3  4  5  6  7) (30 30 30) 
	simpleGrading 	
	(
	  ( 
		(0.5 0.5 0.25)
		(0.5 0.5 4)
	  )
	  (
		(0.5 0.5 0.25)
		(0.5 0.5 4)
	  )
	  (
		(0.5 0.5 0.25)
		(0.5 0.5 4)
	  )
	)
);

edges
(
);

boundary
(
    inletTx
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }
 
    outlet
    {
        type patch;
        faces
        (
            (5 4 7 6)
        );
    }

    KilnWalls
    {
        type patch;
        faces
        (
	    //(0 1 2 3)	    
            (1 5 6 2)
	    //(5 4 7 6)
	    (4 0 3 7)
  	    (3 2 6 7)
	    (0 1 5 4)	
        );
    }
);

// ************************************************************************* //
