TGA Testing/system/probe
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

probes
{
// Where to load it from
functionObjectLibs ( "libsampling.so" );

type        probes;

// Name of the directory for probe data
name        probes;

// Fields to be probed
fields (
        CO2
        O2
	CH4
	H2O
       );

probeLocations
(
   ( 1.6 1.6 1.6 )
   ( 1.4 1.4 1.4 )

);
}
// ************************************************************************* //
